Repository: pypi-data/pypi-mirror-329
Catalog: packages/appcraft/appcraft-0.5.2.tar.gz/appcraft-0.5.2/appcraft/templates/locales/files/locale/*/LC_MESSAGES/core.po
Languages: pt_br

source: Program started!
pt_br: Programa iniciado!

source: Pipenv not found. Installing ...
pt_br: Pipenv não encontrado. Instalando...

source: Package not found.
pt_br: Pacote não encontrado.

source: Trying to install the packages...
pt_br: Tentando instalar os pacotes...

source: Missing packages:
pt_br: Pacotes faltantes:

source: Trying to create a virtual environment and install the packages...
pt_br: Tentando criar um ambiente virtual e instalar os pacotes...

source: Packages installed successfully.
pt_br: Pacotes instalados com sucesso.

source: Error installing packages.
pt_br: Erro ao instalar os pacotes.

source: Please contact the developer.
pt_br: Por favor, entre em contato com o desenvolvedor.

source: Error:
pt_br: Erro:

source: Error executing the program.
pt_br: Erro durante a execução do programa.

source: Execution interrupted!
pt_br: Execução interrompida!

source: Execution finished!
pt_br: Execução finalizada!
