from yyyutils.civil_engineer_utils.Concrete_design_principles import 受弯构件正截面承载力计算, \
    受弯构件斜截面性能与承载力计算, 钢筋混凝土构件使用性能与耐久性

from 受弯构件正截面承载力计算 import T形截面受弯构件正截面承载力计算_工具类, 矩形截面受弯构件正截面承载力计算_单筋梁_工具类
from 受弯构件斜截面性能与承载力计算 import 受弯构件斜截面性能与承载力计算工具类
from 钢筋混凝土构件使用性能与耐久性 import 受拉裂缝控制工具类, 构件的刚度与变形控制工具类


def 初选截面尺寸后对跨中正截面受弯进行配筋(α1, M1k, fc, ft, fy, bf_, hf_, b, h, h0, ξb):
    print(f"{'跨中正截面抗弯配筋':*^80}")
    T形截面受弯构件正截面承载力计算_工具类.判别T形截面类型_截面设计(α1, M1k, fc, bf_, hf_, h0)
    # 第一类T形截面，当做b = bf_的矩形截面处理
    αs = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.αs_对受拉钢筋合力点取矩(α1, M1k, fc, bf_, h0)
    ξ = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.由αs计算相对受压区高度ξ(αs)
    矩形截面受弯构件正截面承载力计算_单筋梁_工具类.判断是否超筋(ξ, ξb)
    ρ = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.受拉钢筋配筋率ρ(α1, fc, fy, ξ)
    As = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.纵向受拉钢筋面积As(ρ, bf_, h0)
    ρmin = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.最小配筋率ρmin(ft, fy)
    print("最小配筋率ρmin：", ρmin)
    ρ1 = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.实际配筋率ρ1(As, b * h)
    print("实际配筋率ρ1：", ρ1)
    矩形截面受弯构件正截面承载力计算_单筋梁_工具类.判断是否少筋(
        ρ1,
        ρmin)
    print("跨中-理论最小As：", As)
    return As


def 初选截面尺寸后对支座截面受弯进行配筋(α1, M2k, fc, ft, fy, bf_, hf_, b, h, h0, ξb):
    print(f"{'支座截面抗弯配筋':*^80}")
    # 倒T形截面，按照b = b的矩形截面处理
    αs = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.αs_对受拉钢筋合力点取矩(α1, M2k, fc, b, h0)
    ξ = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.由αs计算相对受压区高度ξ(αs)
    矩形截面受弯构件正截面承载力计算_单筋梁_工具类.判断是否超筋(ξ, ξb)
    ρ = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.受拉钢筋配筋率ρ(α1, fc, fy, ξ)
    As = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.纵向受拉钢筋面积As(ρ, b, h0)
    ρmin = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.最小配筋率ρmin(ft, fy)
    print("最小配筋率ρmin：", ρmin)
    ρ2 = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.实际配筋率ρ1(As, b * (h - hf_) + bf_ * hf_)
    print("实际配筋率ρ2：", ρ2)
    矩形截面受弯构件正截面承载力计算_单筋梁_工具类.判断是否少筋(
        ρ2,
        ρmin)
    print("理论最小As：", As)
    return As


def 斜截面抗剪配箍筋(C, h0, hf_, V, b, fc, ft, fyv, n, Asv1):
    print(f"{'斜截面抗剪配箍筋':*^80}")

    hw = 受弯构件斜截面性能与承载力计算工具类.hw(h0, hf_)
    βc = 受弯构件斜截面性能与承载力计算工具类.混凝土强度影响系数βc(C)
    受弯构件斜截面性能与承载力计算工具类.判断是否为斜压破坏(V, hw, b, βc, fc, h0)
    ρsvmin = 受弯构件斜截面性能与承载力计算工具类.最小箍筋配筋率ρsvmin(ft, fyv)
    Vc = 受弯构件斜截面性能与承载力计算工具类.剪压区混凝土_无腹筋梁_一般梁_抗剪能力Vc(ft, b, h0)
    Vsv = 受弯构件斜截面性能与承载力计算工具类.与斜裂缝相交的箍筋抗剪能力Vsv_由V减Vc减Vsb(V, Vc)
    # 设配双肢箍筋A8
    Asv = 受弯构件斜截面性能与承载力计算工具类.箍筋各肢全截面面积Asv(n, Asv1)
    smax = 受弯构件斜截面性能与承载力计算工具类.箍筋间距s_由Vsv(h0, Asv, fyv, Vsv)
    print("smax:", smax)
    return smax, ρsvmin, Asv


def 计算最大裂缝宽度(M, Es, Ec, As, Ate, b, h0, bf_, hf_, cs_, ftk, *i组直径_数量_粘结特性系数):
    print(f"{'计算最大裂缝宽度':*^80}")
    αcr = 受拉裂缝控制工具类.构件受力特征系数αcr(3)
    ρte = 受拉裂缝控制工具类.按有效受拉区混凝土截面面积计算的纵向受拉钢筋配筋率ρte(As, Ate)

    αE = 受拉裂缝控制工具类.弹模比αE(Es, Ec)
    ρ = 受拉裂缝控制工具类.理论配筋率ρ(As, b, h0)
    γf_ = 受拉裂缝控制工具类.受压区翼缘加强系数γf_(bf_, b, hf_, h0)
    γs = 受拉裂缝控制工具类.开裂截面内力臂长度系数γs(αE, ρ, γf_)
    σsq = 受拉裂缝控制工具类.开裂截面受拉钢筋应力σsq(M, As, γs, h0)
    ψ = 受拉裂缝控制工具类.纵向受拉钢筋应变不均匀系数ψ_修正(ftk, ρte, σsq)
    cs = 受拉裂缝控制工具类.最外层纵向钢筋外边缘至受拉底边的距离cs(cs_)
    deq = 受拉裂缝控制工具类.等效直径deq(*i组直径_数量_粘结特性系数)
    ωmax = 受拉裂缝控制工具类.最大裂缝宽度ωmax_荷载准永久组合_考虑长期作用_混规(αcr, ψ, σsq, Es, cs, deq, ρte)
    return ωmax


def 计算截面长期刚度(M, θ, Ate, As, bf_, hf_, b, h0, Es, Ec, ftk):
    print(f"{'计算截面长期刚度':*^80}")
    ρte = 构件的刚度与变形控制工具类.按有效受拉区混凝土截面面积计算的纵向受拉钢筋配筋率ρte(As, Ate)
    γf_ = 受拉裂缝控制工具类.受压区翼缘加强系数γf_(bf_, b, hf_, h0)
    print("γf_:", γf_)
    αE = 受拉裂缝控制工具类.弹模比αE(Es, Ec)
    ρ = 受拉裂缝控制工具类.理论配筋率ρ(As, b, h0)
    γs = 受拉裂缝控制工具类.开裂截面内力臂长度系数γs(αE, ρ, γf_)
    σsq = 受拉裂缝控制工具类.开裂截面受拉钢筋应力σsq(M, As, γs, h0)
    ψ = 构件的刚度与变形控制工具类.纵向受拉钢筋应变不均匀系数ψ_修正(ftk, ρte, σsq)
    Bs = 构件的刚度与变形控制工具类.梁的短期刚度Bs(Es, As, h0, ψ, αE, ρ, γf_)
    构件的刚度与变形控制工具类.梁的长期刚度B(Bs, θ)
    return Bs


if __name__ == '__main__':
    C = 40
    α1 = T形截面受弯构件正截面承载力计算_工具类.简化系数α1(C)
    as_ = 0.069
    fc = 19.1e6
    ft = 1.71e6
    fy = 360e6
    bf_ = 1.6
    b = 0.4
    hf_ = 0.1
    h = 1.4
    h0 = T形截面受弯构件正截面承载力计算_工具类.由as计算h0(h, as_)
    M1k = 1484450
    M2k = 718767
    ξb = 0.518
    fyv = 300e6
    V = 655256
    n = 2
    Asv1 = 50.3e-6  # 设配双肢箍筋A8
    初选截面尺寸后对跨中正截面受弯进行配筋(α1, M1k, fc, ft, fy, bf_, hf_, b, h, h0, ξb)
    As1 = 3695e-6
    # 取As1 = 1884mm^2
    γs = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.γs_对受压区合力点取矩(M1k, fy, As1, h0)
    ξ = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.由γs计算ξ(γs)
    矩形截面受弯构件正截面承载力计算_单筋梁_工具类.判断是否超筋(ξ, ξb)

    初选截面尺寸后对支座截面受弯进行配筋(α1, M2k, fc, ft, fy, bf_, hf_, b, h, h0, ξb)
    As2 = 1884e-6
    # 取As = 791mm^2
    γs = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.γs_对受压区合力点取矩(M2k, fy, As2, h0)
    ξ = 矩形截面受弯构件正截面承载力计算_单筋梁_工具类.由γs计算ξ(γs)
    矩形截面受弯构件正截面承载力计算_单筋梁_工具类.判断是否超筋(ξ, ξb)

    s, ρsvmin, Asv = 斜截面抗剪配箍筋(C, h0, hf_, V, b, fc, ft, fyv, n, Asv1)

    ftk = 2.39e6
    h = 1.4
    Mq1 = 768862
    Mq2 = 454418
    Es = 200000e6
    Ec = 32500e6
    cs_ = 0.053
    Ate1 = 0.5 * b * h
    Ate2 = 0.5 * b * h + (bf_ - b) * hf_
    ωmax1 = 计算最大裂缝宽度(Mq1, Es, Ec, As1, Ate1, b, h0, bf_, hf_, cs_, ftk, (0.028, 6, 1), (0.018, 7, 1))
    b = bf_ = 0.4
    h = hf_ = 1.4
    ωmax2 = 计算最大裂缝宽度(Mq2, Es, Ec, As2, Ate2, b, h0, bf_, hf_, cs_, ftk, (0.018, 7, 1), (0.028, 6, 1))
    print("ωmax1:", ωmax1)
    print("ωmax2:", ωmax2)
    # # 斜截面最大挠度0.32mm超限，修改As2为1077mm^2
    # As2 = 1077e-6
    # # 重新计算裂缝宽度
    # ωmax2 = 计算最大裂缝宽度(Mq2 / 2, Es, Ec, As2, b, h0, h, bf_, hf_, ftk, (0.012, 7, 1))
    # print("ωmax2:", ωmax2)

    b = 0.4
    bf_ = 1.6
    h = 1.4
    hf_ = 0.1
    θ = 构件的刚度与变形控制工具类.放大系数θ(0, 1)
    Ate = 0.5 * b * h
    B1 = 计算截面长期刚度(Mq1, θ, Ate, As1, bf_, hf_, b, h0, Es, Ec, ftk)

    b = bf_ = 0.4
    h = hf_ = 1.4
    θ = 构件的刚度与变形控制工具类.放大系数θ(0, 1)
    Ate = 0.5 * b * h + (bf_ - b) * hf_
    B2 = 计算截面长期刚度(Mq2, θ, Ate, As2, bf_, hf_, b, h0, Es, Ec, ftk)
