Repository: pypi-data/pypi-mirror-329
Catalog: packages/django-streamfield/django_streamfield-2.3.2-py3-none-any.whl/streamfield/locale/*/LC_MESSAGES/django.po
Languages: it

source: <ul> <li>The blocks are moved by drag-and-drop.</li> <li>After moving, adding or deleting blocks you need to save the entire object.</li> <li>If you have deleted some blocks accidentally, you may get them back by reloading the page. All edited blocks will remain, in the order of the saved version. Newly added blocks will need to be recreated.</li> </ul>
it: <ul> <li>I blocchi si possono spostare tramite il drag-and-drop.</li> <li>Dopo lo spostamento, l'aggiunta o l'eliminazione di blocchi, è necessario salvare l'intero oggetto.</li> <li>Se si fossero cancellati accidentalmente dei blocchi, è possibile tornare indietro ricaricando la pagina. Così facendo, blocchi già esistenti, anche se modificati, verranno salvati. L'ordinamento sarà quello della versione precedente. Eventuali nuovi blocchi andranno invece persi.</li> </ul>

source: Are you sure that you want to delete this block?
it: Sei sicuro di voler cancellare questo blocco?

source: Are you sure that you want to delete this subblock?
it: Sei sicuro di voler cancellare questo sotto blocco?

source: Collapse all
it: Crolla tutto

source: Open all
it: Apri tutto

source: Add one more
it: Aggiungine un altro

source: Change
it: Modifica

source: Add content
it: Aggiungi contenuto

source: Help?
it: Un aiutino?

source: Add new block
it: Aggiungi un nuovo blocco
